## Plan Result (demo_backendappgateway)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;darts-stub-services&#34;]
* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"
        name                              = "aks00-demo-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (7 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.51.79.250",
              + "10.51.95.250",
            ]
          + name         = "darts-stub-services"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/darts-api" -> null
          - name                                = "darts-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/darts-api" -> null
          - probe_name                          = "darts-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/darts-gateway" -> null
          - name                                = "darts-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/darts-gateway" -> null
          - probe_name                          = "darts-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/dummy-app" -> null
          - name                                = "dummy-app" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/dummy-app" -> null
          - probe_name                          = "dummy-app" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/my-time-api" -> null
          - name                                = "my-time-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/my-time-api" -> null
          - probe_name                          = "my-time-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-account-management" -> null
          - name                                = "pip-account-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/pip-account-management" -> null
          - probe_name                          = "pip-account-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-channel-management" -> null
          - name                                = "pip-channel-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/pip-channel-management" -> null
          - probe_name                          = "pip-channel-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-data-management" -> null
          - name                                = "pip-data-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/pip-data-management" -> null
          - probe_name                          = "pip-data-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-publication-services" -> null
          - name                                = "pip-publication-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/pip-publication-services" -> null
          - probe_name                          = "pip-publication-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-subscription-management" -> null
          - name                                = "pip-subscription-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/pip-subscription-management" -> null
          - probe_name                          = "pip-subscription-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pre-api" -> null
          - name                                = "pre-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/pre-api" -> null
          - probe_name                          = "pre-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pre-portal" -> null
          - name                                = "pre-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/pre-portal" -> null
          - probe_name                          = "pre-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/toffee-recipe-backend" -> null
          - name                                = "toffee-recipe-backend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/toffee-recipe-backend" -> null
          - probe_name                          = "toffee-recipe-backend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-bookings-api" -> null
          - name                                = "vh-bookings-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/vh-bookings-api" -> null
          - probe_name                          = "vh-bookings-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-notification-api" -> null
          - name                                = "vh-notification-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/vh-notification-api" -> null
          - probe_name                          = "vh-notification-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-test-api" -> null
          - name                                = "vh-test-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/vh-test-api" -> null
          - probe_name                          = "vh-test-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-user-api" -> null
          - name                                = "vh-user-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/vh-user-api" -> null
          - probe_name                          = "vh-user-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-video-api" -> null
          - name                                = "vh-video-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/vh-video-api" -> null
          - probe_name                          = "vh-video-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                             

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

agw/httpListeners/dummy-app"
          + http_listener_name         = "dummy-app"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/dummy-app"
          + name                       = "dummy-app"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/my-time-api"
          + backend_address_pool_name  = "my-time-api"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/my-time-api"
          + backend_http_settings_name = "my-time-api"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/my-time-api"
          + http_listener_name         = "my-time-api"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/my-time-api"
          + name                       = "my-time-api"
          + priority                   = 130
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/pip-account-management"
          + backend_address_pool_name  = "pip-account-management"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-account-management"
          + backend_http_settings_name = "pip-account-management"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/pip-account-management"
          + http_listener_name         = "pip-account-management"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/pip-account-management"
          + name                       = "pip-account-management"
          + priority                   = 30
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/pip-channel-management"
          + backend_address_pool_name  = "pip-channel-management"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-channel-management"
          + backend_http_settings_name = "pip-channel-management"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/pip-channel-management"
          + http_listener_name         = "pip-channel-management"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/pip-channel-management"
          + name                       = "pip-channel-management"
          + priority                   = 40
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/pip-data-management"
          + backend_address_pool_name  = "pip-data-management"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-data-management"
          + backend_http_settings_name = "pip-data-management"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/pip-data-management"
          + http_listener_name         = "pip-data-management"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/pip-data-management"
          + name                       = "pip-data-management"
          + priority                   = 50
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/pip-publication-services"
          + backend_address_pool_name  = "pip-publication-services"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-publication-services"
          + backend_http_settings_name = "pip-publication-services"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/pip-publication-services"
          + http_listener_name         = "pip-publication-services"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/pip-publication-services"
          + name                       = "pip-publication-services"
          + priority                   = 60
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/pip-subscription-management"
          + backend_address_pool_name  = "pip-subscription-management"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/pip-subscription-management"
          + backend_http_settings_name = "pip-subscription-management"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/pip-subscription-management"
          + http_listener_name         = "pip-subscription-management"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/pip-subscription-management"
          + name                       = "pip-subscription-management"
          + priority                   = 70
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/toffee-recipe-backend"
          + backend_address_pool_name  = "toffee-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/toffee-recipe-backend"
          + backend_http_settings_name = "toffee-recipe-backend"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/toffee-recipe-backend"
          + http_listener_name         = "toffee-recipe-backend"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/toffee-recipe-backend"
          + name                       = "toffee-recipe-backend"
          + priority                   = 20
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-bookings-api"
          + backend_address_pool_name  = "vh-bookings-api"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-bookings-api"
          + backend_http_settings_name = "vh-bookings-api"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/vh-bookings-api"
          + http_listener_name         = "vh-bookings-api"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/vh-bookings-api"
          + name                       = "vh-bookings-api"
          + priority                   = 80
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-notification-api"
          + backend_address_pool_name  = "vh-notification-api"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-notification-api"
          + backend_http_settings_name = "vh-notification-api"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/vh-notification-api"
          + http_listener_name         = "vh-notification-api"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/vh-notification-api"
          + name                       = "vh-notification-api"
          + priority                   = 90
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-test-api"
          + backend_address_pool_name  = "vh-test-api"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-test-api"
          + backend_http_settings_name = "vh-test-api"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/vh-test-api"
          + http_listener_name         = "vh-test-api"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/vh-test-api"
          + name                       = "vh-test-api"
          + priority                   = 100
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-user-api"
          + backend_address_pool_name  = "vh-user-api"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-user-api"
          + backend_http_settings_name = "vh-user-api"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/vh-user-api"
          + http_listener_name         = "vh-user-api"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/vh-user-api"
          + name                       = "vh-user-api"
          + priority                   = 110
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-video-api"
          + backend_address_pool_name  = "vh-video-api"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/vh-video-api"
          + backend_http_settings_name = "vh-video-api"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/vh-video-api"
          + http_listener_name         = "vh-video-api"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/vh-video-api"
          + name                       = "vh-video-api"
          + priority                   = 120
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "darts-stub-services"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "darts-stub-services"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "darts-stub-services"
          + id                         = (known after apply)
          + name                       = "darts-stub-services"
          + priority                   = 160
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pre-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pre-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pre-api"
          + id                         = (known after apply)
          + name                       = "pre-api"
          + priority                   = 180
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pre-portal"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pre-portal"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pre-portal"
          + id                         = (known after apply)
          + name                       = "pre-portal"
          + priority                   = 170
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      ~ ssl_policy {
          + min_protocol_version = "TLSv1_2"
            # (4 unchanged attributes hidden)
        }

        # (26 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["darts-stub-services"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts-stub-services"
      + records             = [
          + "10.51.96.132",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":541,"Program":"tfcmt","SHA1":"","Target":"demo_backendappgateway","Vars":{}} -->